In [1]:
import re
string = "Python and Machine Learning 7741 is syllabus of Data Science."
result = re.findall("[a-zA-Z0-9]",string)
result

['P',
 'y',
 't',
 'h',
 'o',
 'n',
 'a',
 'n',
 'd',
 'M',
 'a',
 'c',
 'h',
 'i',
 'n',
 'e',
 'L',
 'e',
 'a',
 'r',
 'n',
 'i',
 'n',
 'g',
 '7',
 '7',
 '4',
 '1',
 'i',
 's',
 's',
 'y',
 'l',
 'l',
 'a',
 'b',
 'u',
 's',
 'o',
 'f',
 'D',
 'a',
 't',
 'a',
 'S',
 'c',
 'i',
 'e',
 'n',
 'c',
 'e']

In [2]:
string = "Python and Machine Learning is syllabus of data science and deep learning."
result = re.split(r"and",string)
result

['Python ',
 ' Machine Learning is syllabus of data science ',
 ' deep learning.']

In [3]:
str1='Python and Data Science Batch 2023'
result = re.findall(r"\bab*[a-z]*\b",str1)
result

['and']

In [5]:
sample_string = "There are 123 45 678 90 2345 67 12 345 6789 0123 three-digit"
result = re.findall(r"\b\d{3}\s\d{2}\b",sample_string)
result

['123 45', '678 90']

In [6]:
str1= "python and data pytthon science pythonnn pyyth annd pythh"
result = re.findall(r"p+",str1)
result

['p', 'p', 'p', 'p', 'p']

In [7]:
str1 = 'We can write INFORM in lowercase as inform'
result = re.findall(r"INFORM|inform",str1)
result

['INFORM', 'inform']

In [8]:
str1= " data science and pytthon science abbbss and pyt"
result = re.findall(r"py?",str1)
result

['py', 'py']

In [9]:
str1= "python and data pbbbtthon science pytbbbonnn and pyt"
result = re.findall(r"\b\w*[b]{3}\w*\b",str1)
result

['pbbbtthon', 'pytbbbonnn']

In [10]:
str1= "abbbs and data abbbsolutely science abbrivation and pyt"
result = re.findall(r"\b\w*[b]{2,3}\w*\b",str1)
result

['abbbs', 'abbbsolutely', 'abbrivation']

In [11]:
str1= "abbbs and data abbbsolutely or science an abbrivation and pyt"
result = re.findall(r"\b\w{3,5}\b",str1)
result

['abbbs', 'and', 'data', 'and', 'pyt']

In [12]:
str1= "abbbs and data abbbsolutely or science_ an abbrivation_ and pyt_"
result = re.findall(r"[a-z]+[_]",str1)
result

['science_', 'abbrivation_', 'pyt_']

In [13]:
str1= "Abbbs and Data Abbbsolutely or Science_ an Abbrivation_ and pyt_"
result = re.findall(r"[A-Z][a-z]+[_]",str1)
result

['Science_', 'Abbrivation_']

In [14]:
str1= "data absorb Science and Abbrivation and pyt"
result = re.findall(r"\ba.+b\b",str1)
result

['absorb']

In [15]:
str1 = 'Suceess is a jurney not a desti9nation.'
result = re.findall(r"Suceess",str1)
result

['Suceess']

In [16]:
str1 = 'new begening of LIFE .'
result = re.findall(r"LIFE .",str1)
result

['LIFE .']

In [17]:
str1 = "today is the very lazy day"
result = re.findall(r"\w*z\w",str1)
result

['lazy']

In [18]:
str1 = "we have a lazy cat"
result = re.findall(r"[a-y]*z[a-y]",str1)
result

['lazy']

In [19]:
str1 = "RudrANSHI_12345_wadekar"
result = re.findall(r"\w{1,}",str1)
result

['RudrANSHI_12345_wadekar']

In [20]:
str1 = "9821 maya"
result = re.findall(r"^\d*",str1)
result

['9821']

In [21]:
ip_adress="216.008.904.196"
result = re.sub(r"\b0.","",ip_adress)
result

'216.8.904.196'

In [22]:
str1="Python is required for data science version 3.2"
result = re.findall(r"\d\b",str1)
result

['3', '2']

In [23]:
str1 = "Exercises number 1, 12, 13, and 345 are important"
result = re.findall(r"[0-9]+",str1)
result

['1', '12', '13', '345']

In [24]:
Sample_text ='The quick brown fox jumps over the lazy dog.'
Searched_words ='fox', 'dog', 'horse'
for word in Searched_words:
    result = re.findall(word,Sample_text)
    print(result)

['fox']
['dog']
[]

In [25]:
sample_text ='The quick brown fox jumps over the lazy dog.'
result = re.search(r"fox",sample_text)
result

In [26]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
result

['exercises', 'exercises', 'exercises']

In [27]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
print(len(result))
result = re.search(r"exercises",Sample_text)
print(result)

3
<re.Match object; span=(7, 16), match='exercises'>

In [28]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","_",str1)
print(result)
result = re.sub(r"[_]"," ",result)
print(result)

The_quick_brown_fox_jumps_over_the_lazy_dog.
The quick brown fox jumps over the lazy dog.

In [29]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","",str1)
result

'Thequickbrownfoxjumpsoverthelazydog.'

In [30]:
str1= "python and data science pythonnn"
result = re.findall(r"[p]\w*",str1)
result

['python', 'pythonnn']

In [31]:
str1= "data science and python learning with begening every evening "
result = re.findall(r"\b[a,e]\w*",str1)
result

['and', 'every', 'evening']

In [32]:
str1 = "i am mrunal chaudhari ,my age is 24"
result = re.search(r"\d",str1)
result

In [33]:
text ="""Python. is a general,purpose, interpreted."""
result = re.sub(r"[,. ]",":",text)
result

'Python::is:a:general:purpose::interpreted:'

In [34]:
text ="""Python., is a general purpose interpreted."""
result = re.sub(r"[,. ]{2}",":",text)
result

'Python: is a general purpose interpreted.'

In [35]:
text ="""123 Python is a general-purpose, interpreted,
high-level programming language popularly used for
website development, data analytics 78 and automation."""

result = re.findall(r"\b\D{3,5}\b",text)
result

[' is a', 'high-', 'level', ' used', ' for\n', 'data ', ' and ']

In [1]:
import numpy as np

In [2]:
arr1 = np.zeros(10)
arr1

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [3]:
arr1.nbytes

80

In [4]:
arr1 = np.zeros(10)
print(arr1)
arr1[4] = 1
arr1

[0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]

array([0., 0., 0., 0., 1., 0., 0., 0., 0., 0.])

In [5]:
arr1 = np.arange(15,46)
arr1

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
       32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45])

In [6]:
arr1[::-1]

array([45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31, 30, 29,
       28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15])

In [8]:
arr2 = reversed(arr1)
list(arr2)

[45,
 44,
 43,
 42,
 41,
 40,
 39,
 38,
 37,
 36,
 35,
 34,
 33,
 32,
 31,
 30,
 29,
 28,
 27,
 26,
 25,
 24,
 23,
 22,
 21,
 20,
 19,
 18,
 17,
 16,
 15]

In [9]:
arr1 = np.random.randint(1,10,size=(2,2))
print("Array1:\n",arr1)
arr2 = np.random.randint(1,10,size=(2,2))
print("Array2:\n",arr2)

Array1:
 [[9 6]
 [1 8]]
Array2:
 [[3 3]
 [7 7]]

In [10]:
add1 = arr1 + arr2
add1

array([[12,  9],
       [ 8, 15]])

In [11]:
sub1 = arr1 - arr2
sub1

array([[ 6,  3],
       [-6,  1]])

In [12]:
arr1 = np.array([1.3,1.8,2.3,3.9,1,4,1.9,9,.3])
arr1.round()

array([1., 2., 2., 4., 1., 4., 2., 9., 0.])

In [13]:
np.floor(arr1)

array([1., 1., 2., 3., 1., 4., 1., 9., 0.])

In [14]:
np.ceil(arr1)

array([2., 2., 3., 4., 1., 4., 2., 9., 1.])

In [15]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Array:\n",arr1)
result = np.mean(arr1,axis=1)
print("Mean across row:",result)
result = np.mean(arr1,axis=0)
print("Mean across column:",result)

Array:
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
Mean across row: [2. 5. 8.]
Mean across column: [4. 5. 6.]

In [16]:
list1 = [0,30,45,60,90]
result = np.deg2rad(list1)
result

array([0.        , 0.52359878, 0.78539816, 1.04719755, 1.57079633])

In [17]:
arr1 = np.arange(9).reshape(3,3)
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [18]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print(arr1)
arr1[:: , ::-1]

[[1 2 3]
 [4 5 6]
 [7 8 9]]

array([[3, 2, 1],
       [6, 5, 4],
       [9, 8, 7]])

In [19]:
arr1[::-1]

array([[7, 8, 9],
       [4, 5, 6],
       [1, 2, 3]])

In [20]:
result = np.nonzero([1,2,0,0,4,0])
result

(array([0, 1, 4], dtype=int64),)

In [21]:
arr1 = np.array([[1,2],[3,4]])
print(arr1)
result = np.linalg.det(arr1)
result

[[1 2]
 [3 4]]

-2.0000000000000004

In [22]:
arr1 = np.array([[2,3],[3,9]])
print(arr1)
result = np.linalg.inv(arr1)
result

[[2 3]
 [3 9]]

array([[ 1.        , -0.33333333],
       [-0.33333333,  0.22222222]])

In [23]:
arr1 = np.random.randint(1,10,size=(30))
print(arr1)
result = np.mean(arr1)
result

[4 6 9 1 9 3 4 8 4 8 8 2 2 2 9 8 6 1 3 3 8 3 5 8 6 5 1 2 8 1]

4.9

In [24]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print(arr1)
result = np.where(arr1>5)
result

[ 1  2  3  4  5  6  7  8  9 10]

(array([5, 6, 7, 8, 9], dtype=int64),)

In [25]:
arr1 = np.random.random((3,3,3))
arr1

array([[[0.61392707, 0.41113097, 0.84246706],
        [0.05334586, 0.45084261, 0.44342078],
        [0.69726503, 0.02670052, 0.31233422]],

       [[0.67728973, 0.7770817 , 0.36452458],
        [0.14050502, 0.28137015, 0.76670071],
        [0.50559735, 0.61999189, 0.15037734]],

       [[0.8988207 , 0.44090183, 0.03734894],
        [0.99892274, 0.6338682 , 0.54115115],
        [0.56196844, 0.84601021, 0.24420561]]])

In [26]:
arr1 = np.random.rand(10,10)
print(arr1)
result = np.max(arr1)
result

[[0.99582083 0.26510204 0.7578072  0.2676346  0.20919233 0.55632685
  0.80128151 0.56517926 0.75205576 0.25534539]
 [0.73212112 0.15366562 0.5552384  0.34852721 0.57147571 0.64173848
  0.9421771  0.42406201 0.03095641 0.63728274]
 [0.64962839 0.55370044 0.63214788 0.27337765 0.22281644 0.01533995
  0.38658754 0.69748025 0.76230951 0.40264121]
 [0.56099408 0.38044489 0.20806523 0.13377999 0.87350966 0.71520398
  0.42453649 0.09502981 0.17448169 0.19399054]
 [0.59121192 0.67350172 0.26159048 0.69118282 0.97460897 0.95824044
  0.93969271 0.59315326 0.98989667 0.58473335]
 [0.94207076 0.01420047 0.84044886 0.62859208 0.58962378 0.33531278
  0.5405282  0.35351977 0.89038899 0.48930984]
 [0.76531415 0.9506205  0.37694615 0.56460663 0.19116928 0.04478073
  0.91115771 0.38672424 0.93339571 0.37199634]
 [0.3785535  0.6657266  0.59164942 0.47028717 0.95387602 0.50594168
  0.08828593 0.66959356 0.42415601 0.28320157]
 [0.76620746 0.08555244 0.99206404 0.31542255 0.32879087 0.61195366
  0.42224174 0.60361821 0.00811916 0.76648131]
 [0.93706632 0.24244157 0.45259457 0.61737654 0.49392248 0.33380835
  0.9794741  0.00566329 0.48226213 0.79006593]]

0.995820827931458

In [27]:
np.min(arr1)

0.005663290325277459

In [28]:
arr1 = np.ones((10,10))
arr1[1:-1,1:-1] = 0
arr1

array([[1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [29]:
arr1 = np.zeros((5,5),dtype=int)
np.fill_diagonal(arr1[1:],[1,2,3,4])
arr1

array([[0, 0, 0, 0, 0],
       [1, 0, 0, 0, 0],
       [0, 2, 0, 0, 0],
       [0, 0, 3, 0, 0],
       [0, 0, 0, 4, 0]])

In [30]:
arr1 = np.eye(3,3)
arr1

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [31]:
arr1 = np.random.randint(1,9, size=(5,3))
arr2 = np.random.randint(1,9, size=(3,2))
result = np.dot(arr1, arr2)
result

array([[44, 59],
       [68, 46],
       [38, 35],
       [48, 37],
       [98, 79]])

In [32]:
arr1 = np.array([1,2,3,4,5,6,7,8,44,9,33,6,5,10])
print(arr1)
result = np.where((arr1 >= 3) & (arr1 <= 8),-1*arr1,arr1)
result

[ 1  2  3  4  5  6  7  8 44  9 33  6  5 10]

array([ 1,  2, -3, -4, -5, -6, -7, -8, 44,  9, 33, -6, -5, 10])

In [33]:
arr1 = np.array([[1.215413,2.654139],[3.4513056,5.2141555]])
print(arr1)
result = np.around(arr1)
result

[[1.215413  2.654139 ]
 [3.4513056 5.2141555]]

array([[1., 3.],
       [3., 5.]])

In [34]:
arr1 = np.array([1,2,3,4,5,6])
arr2 = np.array([4,5,6,7,8,9])
result = np.intersect1d(arr1, arr2)
result

array([4, 5, 6])

In [35]:
arr1 = np.linspace(0,1,10)[1:-1]
arr1

array([0.11111111, 0.22222222, 0.33333333, 0.44444444, 0.55555556,
       0.66666667, 0.77777778, 0.88888889])

In [36]:
arr1 = np.random.randint(1,10,size=10)
print(arr1)
result = np.sort(arr1)
result

[9 2 8 5 9 1 2 8 3 9]

array([1, 2, 2, 3, 5, 8, 8, 9, 9, 9])

In [37]:
arr1 = np.zeros((5,5))
print(arr1)
arr2 = arr1 + np.arange(5)
arr2

[[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]

array([[0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.],
       [0., 1., 2., 3., 4.]])

In [38]:
A = np.random.randint(0,5,size=5)
B = np.random.randint(0,5,size=5)
if np.equal == True:
    print("Both arrays are equal")
else:
    print("Both arrays are not equal")

Both arrays are not equal

In [39]:
np.allclose(arr1, arr2)

False

In [40]:
arr1 = np.random.randint(1,10,size=10)
print(arr1)
result = np.where(arr1 == np.max(arr1), 0,arr1)
result

[6 7 1 9 2 3 1 4 6 4]

array([6, 7, 1, 0, 2, 3, 1, 4, 6, 4])

In [41]:
arr1 = np.array([[[1,2,3],[4,5,6],[7,8,9]]])
for i in np.nditer(arr1):
    print(i,end=" ")

1 2 3 4 5 6 7 8 9

In [42]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
for index,value in np.ndenumerate(arr1):
    print(f"{index} index has {value} values")

(0, 0) index has 1 values
(0, 1) index has 2 values
(0, 2) index has 3 values
(1, 0) index has 4 values
(1, 1) index has 5 values
(1, 2) index has 6 values
(2, 0) index has 7 values
(2, 1) index has 8 values
(2, 2) index has 9 values

In [43]:
arr1 = np.random.randint(1,10,size=(3,3))
print(f"Array:\n",arr1)
result = (arr1[arr1[:,2].argsort()])
result

Array:
 [[9 2 8]
 [2 4 6]
 [7 4 9]]

array([[2, 4, 6],
       [9, 2, 8],
       [7, 4, 9]])

In [44]:
arr1 = np.array([[4,3,1],[5,8,9],[3,4,5]])
print("Array:\n",arr1)
arr1[[0,2]] = arr1[[2,0]]
arr1

Array:
 [[4 3 1]
 [5 8 9]
 [3 4 5]]

array([[3, 4, 5],
       [5, 8, 9],
       [4, 3, 1]])

In [45]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
result = np.mean(arr1)
result

5.5

In [46]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
result = np.median(arr1)
result

5.5

In [47]:
arr1 = np.random.randint(1,10,size =10)
result = np.std(arr1)
result

2.539685019840059

In [48]:
from scipy.stats import mode
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
result = mode(arr1)
result

ModeResult(mode=1, count=1)

In [49]:
result = np.around(5.4342,2)
result

5.43

In [50]:
arr1 = np.array([[2,3],[3,4]])
result = np.linalg.inv(arr1)
result

array([[-4.,  3.],
       [ 3., -2.]])

In [51]:
x = np.array([1,2,3])
y = np.array([4,5,6])
result = np.cov(x,y)
result

array([[1., 1.],
       [1., 1.]])

In [52]:
arr1 = np.array([1,1,2,2,3,4,5,6,7,8,9,6,4,3,6,7])
result = mode(arr1)[0]
result

6

In [53]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print(arr1)
arr1.shape
arr2 = np.reshape(arr1,(2,5,1))
arr2

[ 1  2  3  4  5  6  7  8  9 10]

array([[[ 1],
        [ 2],
        [ 3],
        [ 4],
        [ 5]],

       [[ 6],
        [ 7],
        [ 8],
        [ 9],
        [10]]])

In [54]:
arr1 = np.random.randint(1,20,size=(1,2,3,4))
print(arr1)
arr2 = np.reshape(arr1,(6,4))
arr2

[[[[ 7 13  7 13]
   [19 12  7 18]
   [11 17 19  4]]

  [[15 11  4 18]
   [15  6 10 12]
   [ 8  2 18 17]]]]

array([[ 7, 13,  7, 13],
       [19, 12,  7, 18],
       [11, 17, 19,  4],
       [15, 11,  4, 18],
       [15,  6, 10, 12],
       [ 8,  2, 18, 17]])

In [55]:
arr1 = np.zeros(10,dtype=int)
arr1

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [56]:
arr1 = np.array([[1,2,3,4],[5,6,8,7],[3,4,5,6]])
print(arr1)
arr1.shape

[[1 2 3 4]
 [5 6 8 7]
 [3 4 5 6]]

(3, 4)

In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
list1 = [[1,2,3],[4,5,6]]
pd.DataFrame(list1)

   0  1  2
0  1  2  3
1  4  5  6

In [4]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
df

     A    B    C
P  NaN  NaN  NaN
Q  NaN  NaN  NaN
R  NaN  NaN  NaN

In [5]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
if df.isnull:
    print("Datframe is empty")
else:
    print("Datframe is not empty")

Datframe is empty

In [6]:
arr1 = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(arr1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
list1 = [[1,2,3],[4,5,6]]
df = pd.DataFrame(list1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [8]:
tuple1 = (1,2,3,4,5,6)
df = pd.DataFrame(tuple1)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [9]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [10]:
l1 = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(l1,columns=list("ABC"))
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
df = pd.DataFrame(np.random.randint(1,10,size=(4,5)))
df

   0  1  2  3  4
0  3  4  1  5  1
1  3  4  8  1  7
2  7  8  2  5  6
3  2  9  6  8  1

In [12]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(arr1)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [14]:
s1 = pd.Series([1,2,3,4,5])
print(s1)
s2 = s1.copy()
s2[0] = 50
print(s2)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    50
1     2
2     3
3     4
4     5
dtype: int64

In [15]:
df = pd.DataFrame(np.full((4,5),6))
df["5"] = [1,2,3,4]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4

In [16]:
df.loc[4] = [1,2,3,4,5,6]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4
4  1  2  3  4  5  6

In [17]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(arr1,index=list("ABC"))
df

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [18]:
arr1 = np.random.randint(1,10,size=(4,4))
df = pd.DataFrame(arr1,columns=list("PQRS"),index=list("ABCD"))
df

   P  Q  R  S
A  9  7  5  2
B  1  6  7  4
C  7  9  9  7
D  3  5  8  7

In [19]:
df.rename({"P":"p","Q":"q","R":"r","S":"s"},axis=1,inplace=True)
df.rename({"A":"a","B":"b","C":"c","D":"d"},axis=0,inplace=True)
df

   p  q  r  s
a  9  7  5  2
b  1  6  7  4
c  7  9  9  7
d  3  5  8  7

In [20]:
for i in df.items():
    print(i)

('p', a    9
b    1
c    7
d    3
Name: p, dtype: int32)
('q', a    7
b    6
c    9
d    5
Name: q, dtype: int32)
('r', a    5
b    7
c    9
d    8
Name: r, dtype: int32)
('s', a    2
b    4
c    7
d    7
Name: s, dtype: int32)

In [21]:
for i in df.iterrows():
    print(i)

('a', p    9
q    7
r    5
s    2
Name: a, dtype: int32)
('b', p    1
q    6
r    7
s    4
Name: b, dtype: int32)
('c', p    7
q    9
r    9
s    7
Name: c, dtype: int32)
('d', p    3
q    5
r    8
s    7
Name: d, dtype: int32)

In [22]:
df = pd.DataFrame(np.random.randint(10,20,size=(4,4)))
print(df)
arr1 = df.values
arr1

    0   1   2   3
0  11  13  12  10
1  19  18  17  12
2  13  17  11  19
3  14  19  14  16

array([[11, 13, 12, 10],
       [19, 18, 17, 12],
       [13, 17, 11, 19],
       [14, 19, 14, 16]])

In [23]:
arr1.tolist()

[[11, 13, 12, 10], [19, 18, 17, 12], [13, 17, 11, 19], [14, 19, 14, 16]]

In [24]:
df

    0   1   2   3
0  11  13  12  10
1  19  18  17  12
2  13  17  11  19
3  14  19  14  16

In [25]:
df.reset_index(drop=True)

    0   1   2   3
0  11  13  12  10
1  19  18  17  12
2  13  17  11  19
3  14  19  14  16

In [26]:
df = pd.DataFrame(np.random.randint(10,20,size=(4,5)))
print(df.shape[0])
print(df.shape[1])

4
5

In [27]:
s1 = pd.Series(np.arange(50,60))
s2 = pd.Series(np.arange(25,35))
print("Addition:",s1+s2)
print("Subtraction:",s1-s2)
print("Multiplication:",s1*s2)
print("Division:",s1/s2)

Addition: 0    75
1    77
2    79
3    81
4    83
5    85
6    87
7    89
8    91
9    93
dtype: int32
Subtraction: 0    25
1    25
2    25
3    25
4    25
5    25
6    25
7    25
8    25
9    25
dtype: int32
Multiplication: 0    1250
1    1326
2    1404
3    1484
4    1566
5    1650
6    1736
7    1824
8    1914
9    2006
dtype: int32
Division: 0    2.000000
1    1.961538
2    1.925926
3    1.892857
4    1.862069
5    1.833333
6    1.806452
7    1.781250
8    1.757576
9    1.735294
dtype: float64

In [28]:
df = pd.read_excel("Sample1.xlsx")
df

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468
...,...,...,...,...,...,...,...,...
995,996,Roma,Lafollette,Female,United States,34,15/10/2017,2654
996,997,Felisa,Cail,Female,United States,28,16/08/2016,6525
997,998,Demetria,Abbey,Female,United States,32,21/05/2015,3265
998,999,Jeromy,Danz,Male,United States,39,15/10/2017,3265
999,1000,Rasheeda,Alkire,Female,United States,29,16/08/2016,6125

In [29]:
df.columns

Index(['Unnamed: 0', 'First Name', 'Last Name', 'Gender', 'Country', 'Age',
       'Date', 'Id'],
      dtype='object')

In [30]:
df[['First Name', 'Last Name']]

    First Name   Last Name
0        Dulce       Abril
1         Mara   Hashimoto
2       Philip        Gent
3     Kathleen      Hanner
4      Nereida     Magwood
..         ...         ...
995       Roma  Lafollette
996     Felisa        Cail
997   Demetria       Abbey
998     Jeromy        Danz
999   Rasheeda      Alkire

[1000 rows x 2 columns]

In [31]:
df["Age"].sum()

33260

In [32]:
df["Age"].mean()

33.26

In [33]:
df["Age"].max()

58

In [34]:
df["Age"].min()

21

In [35]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S

In [36]:
df.groupby(df["Embarked"]).get_group("S")

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [38]:
arr1 = np.random.randint(1,20,size=(4,2))
df = pd.DataFrame(arr1)
print(df)
df.apply(np.sqrt)

    0   1
0  15   7
1   5   1
2  10   6
3   4  12

          0         1
0  3.872983  2.645751
1  2.236068  1.000000
2  3.162278  2.449490
3  2.000000  3.464102

In [39]:
df = pd.DataFrame(np.random.randint(1,9,size=(3,4)))
df

   0  1  2  3
0  5  2  3  7
1  3  3  5  3
2  1  5  6  7

In [40]:
df.apply(lambda x : x**2)

    0   1   2   3
0  25   4   9  49
1   9   9  25   9
2   1  25  36  49

In [41]:
def cube(x):
    val = x**3
    return val
df.apply(cube)

     0    1    2    3
0  125    8   27  343
1   27   27  125   27
2    1  125  216  343

In [42]:
arr1 = np.random.randint(1,20,size=(4,2))
df = pd.DataFrame(arr1)
print(df)
df.apply(lambda x : x**2)

    0   1
0  17  16
1   7   6
2   6   9
3  16  18

     0    1
0  289  256
1   49   36
2   36   81
3  256  324

In [43]:
df = pd.read_csv("diabetes.csv")
df

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1
3,150,66,23,94,28.1,0.167,21,0
4,150,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...
763,101,76,48,180,32.9,0.171,63,0
764,122,70,27,0,36.8,0.340,27,0
765,121,72,23,112,26.2,0.245,30,0
766,126,60,0,0,30.1,0.349,47,1
767,93,70,31,0,30.4,0.315,23,0

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Glucose                   768 non-null    int64
 1   BloodPressure             768 non-null    int64
 2   SkinThickness             768 non-null    int64
 3   Insulin                   768 non-null    int64
 4   BMI                       768 non-null    float64
 5   DiabetesPedigreeFunction  768 non-null    float64
 6   Age                       768 non-null    int64
 7   Outcome                   768 non-null    int64
dtypes: float64(2), int64(6)
memory usage: 48.1 KB

In [45]:
df.describe()

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,121.117188,69.076823,20.536458,79.799479,31.992578,0.471876,33.243490,0.348958
std,31.805091,19.367794,15.952218,115.244002,7.884160,0.331329,11.758182,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,142.000000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [46]:
df.head()

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1
3,150,66,23,94,28.1,0.167,21,0
4,150,40,35,168,43.1,2.288,33,1

In [47]:
df.tail()

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
763,101,76,48,180,32.9,0.171,63,0
764,122,70,27,0,36.8,0.340,27,0
765,121,72,23,112,26.2,0.245,30,0
766,126,60,0,0,30.1,0.349,47,1
767,93,70,31,0,30.4,0.315,23,0

In [48]:
data1 = {"NAME" : ["Rudranshi","Sanvi","Swati","Shiva"]}
df = pd.DataFrame(data1)
df["NAME"].apply(lambda x : x.istitle())

0    True
1    True
2    True
3    True
Name: NAME, dtype: bool

In [49]:
d1 = {"Employee":["Saniya","Sara","Alexa","Jenny"]}
df = pd.DataFrame(d1)
d2 = {"Saniya": "Software Developer" , "Sara":"Developer" , "Alexa":"Assistant"}
df["designation"] = df["Employee"].map(d2)
df

  Employee         designation
0   Saniya  Software Developer
1     Sara           Developer
2    Alexa           Assistant
3    Jenny                 NaN

In [50]:
arr1 = np.random.randint(1,10,size=(5,5))
df = pd.DataFrame(arr1,columns=list("ABCDE"))
df

   A  B  C  D  E
0  3  6  8  2  2
1  1  6  1  3  7
2  3  8  8  2  5
3  5  4  9  4  9
4  8  8  6  4  4

In [51]:
df["I"] = [1,2,3,4,5]
df

   A  B  C  D  E  I
0  3  6  8  2  2  1
1  1  6  1  3  7  2
2  3  8  8  2  5  3
3  5  4  9  4  9  4
4  8  8  6  4  4  5

In [52]:
df.insert(1,"H",[1,2,1,2,1])
df

   A  H  B  C  D  E  I
0  3  1  6  8  2  2  1
1  1  2  6  1  3  7  2
2  3  1  8  8  2  5  3
3  5  2  4  9  4  9  4
4  8  1  8  6  4  4  5

In [53]:
df.drop("A",axis=1,inplace=True)

In [54]:
df

   H  B  C  D  E  I
0  1  6  8  2  2  1
1  2  6  1  3  7  2
2  1  8  8  2  5  3
3  2  4  9  4  9  4
4  1  8  6  4  4  5

In [55]:
df.drop(2,axis=0,inplace=True)
df

   H  B  C  D  E  I
0  1  6  8  2  2  1
1  2  6  1  3  7  2
3  2  4  9  4  9  4
4  1  8  6  4  4  5

In [56]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([4,5,6,7,8])
s11 = set(s1)
s22 = set(s2)
result = s11.symmetric_difference(s22)
final = list(result)
final

[1, 2, 3, 6, 7, 8]

In [57]:
s1 = pd.Series([1,2,3,4,5])
print("Median:",s1.median())
print("Minimum:",s1.min())
print("25th percentile:",s1.quantile(0.25))
print("75th percentile:",s1.quantile(0.75))
print("Maximum:",s1.max())

Median: 3.0
Minimum: 1
25th percentile: 2.0
75th percentile: 4.0
Maximum: 5

In [58]:
df = pd.DataFrame(np.random.randint(10,50,size=(4,4)) , columns=list("CABD") , index=list("xzvs"))
df

    C   A   B   D
x  15  46  27  38
z  37  27  45  30
v  43  48  11  43
s  49  27  23  37

In [59]:
df.sort_index()

    C   A   B   D
s  49  27  23  37
v  43  48  11  43
x  15  46  27  38
z  37  27  45  30

In [60]:
df.sort_index(axis=1)

    A   B   C   D
x  46  27  15  38
z  27  45  37  30
v  48  11  43  43
s  27  23  49  37

In [61]:
df.sort_values("D")

    C   A   B   D
z  37  27  45  30
s  49  27  23  37
x  15  46  27  38
v  43  48  11  43

In [62]:
df = pd.DataFrame({"A" : [1,1,3,4,5],
                   "B" : [1,1,3,4,5],
                   "C" : [1,1,3,4,5],
                   "D" : [1,1,3,4,5]})
df

   A  B  C  D
0  1  1  1  1
1  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [63]:
df.drop_duplicates()

   A  B  C  D
0  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [64]:
data = {'Full Name': ['John Doe', 'Jane Smith', 'Bob Johnson']}
df = pd.DataFrame(data)

df[["First Name","Last Name"]] = df["Full Name"].str.split(expand=True)
df

     Full Name First Name Last Name
0     John Doe       John       Doe
1   Jane Smith       Jane     Smith
2  Bob Johnson        Bob   Johnson